{
  "me": "Ellie",
  "title": "Liam",
  "type": "direct",
  "contact": "Liam",
  "messages": [
    { "sender": "Ellie", "text": "Liam, why u never told me my DJ slot got axed ~3am? I prepped for weeks!" },
    { "sender": "Liam", "text": "Mate, I only heard last min. Thought u knew, swear." },
    { "sender": "Ellie", "text": "Heard? Email screenshot shows u got told b4 me. What’s good?" },
    { "sender": "Liam", "text": "Ellie, chill, it’s a mix-up. I didn’t know till late." },
    { "sender": "Ellie", "text": "Mix-up? U got a backstage pass & I’m stuck in crowd. U playing me?" },
    { "sender": "Liam", "text": "Nah, mate, pass was for helping set up. I ain’t playing u." },
    { "sender": "Ellie", "text": "Helping? Mate, festival page says u DJed my slot! How’s that happen?" },
    { "sender": "Liam", "text": "What? No way, that’s a typo. I didn’t DJ, I swear." },
    { "sender": "Ellie", "text": "Typo? Ppl on Insta saw u on stage ~3am. My slot, Liam!" },
    { "sender": "Liam", "text": "Ok, Ellie, I was on stage, but it wasn’t planned. They forced me." },
    { "sender": "Ellie", "text": "Forced u? Liam, stop chatting rubbish. Who’s ‘they’?" },
    { "sender": "Liam", "text": "Festival boss, Max. He’s dodgy, said I had to fill in or else." },
    { "sender": "Ellie", "text": "Or else what? U stole my shot for a shady dude? I’m proper gutted" },
    { "sender": "Liam", "text": "Mate, I’m sorry. Max had dirt on me, said he’d ruin me." },
    { "sender": "Ellie", "text": "Dirt? What u done, Liam? This ain’t adding up" },
    { "sender": "Liam", "text": "I owed Max money from a gig last year. He blackmailed me to take ur slot." },
    { "sender": "Ellie", "text": "Blackmailed? For my slot? Why u never told me, mate?" },
    { "sender": "Liam", "text": "I was scared, Ellie. Max is tied to some proper bad lot." },
    { "sender": "Ellie", "text": "Bad lot? Liam, what mess u in? This is my career too!" },
    { "sender": "Liam", "text": "Max is rigging the festival livestream, scamming sponsors. I got dragged in." },
    { "sender": "Ellie", "text": "Scamming? U knew & still took my slot? This is next level" },
    { "sender": "Liam", "text": "I didn’t want to! He threatened to leak my debt to everyone." },
    { "sender": "Ellie", "text": "Leak debt? Now u’re in a scam & I’m out my gig? I can’t even" },
    { "sender": "Liam", "text": "Ellie, I’m sorting it. Pls don’t hate me, I’m begging." },
    { "sender": "Ellie", "text": "Sort it? Max’s goons r after u now, yeah? I saw their texts on ur phone" },
    { "sender": "Liam", "text": "U saw? Ok, I’m in deep, but I’ll fix it. Just don’t tell anyone." },
    { "sender": "Ellie", "text": "Don’t tell? I could expose Max & save my rep, but u’re my mate" },
    { "sender": "Ellie", "text": "I need time. Don’t msg me till I figure out what’s right." }
  ],
  "pitch": "3am festival drama: best mate steals her DJ slot! Sabotage or blackmail? The truth is wild!",
  "caption": "My best mate ruined my DJ gig at 3am! Sabotage or saving his skin? #TextStory",
  "hashtags": ["#TextStory", "#FestivalVibes", "#PlotTwist", "#FriendshipDrama", "#Receipts", "#ForYou", "#Viral", "#MusicFestival", "#UKGenZ", "#MoralDilemma", "#DJLife", "#StoryTime"]
}